README.org
#+TITLE: Literate NixOS Configuration
#+AUTHOR: Darris Hawks
#+STARTUP: overview
#+OPTIONS: toc:2
#+auto_tangle: t

* Table of Contents
:PROPERTIES:
:TOC: :include siblings :depth 2
:END:
:CONTENTS:
- [[#table-of-contents][Table of Contents]]
- [[#issues-to-address][Issues to Address]]
- [[#features-to-add][Features to Add]]
- [[#structural-changes-for-configuration][Structural Changes for Configuration]]
- [[#home-manager][Home Manager]]
  - [[#main-file-homenix][Main File: home.nix]]
- [[#nixos][NixOS]]
  - [[#main-file-configurationnix][Main File: configuration.nix]]
  - [[#also-important-hardware-configurationnix][Also Important: hardware-configuration.nix]]
- [[#secrets][Secrets]]
- [[#fix-some-hardware-errors][Fix Some Hardware Errors]]
  - [[#error-logs][Error logs]]
  - [[#attempts-to-fix-it][Attempts to fix it]]
:END:

* Issues to Address
1. Hardware
* TODO Features to Add
1. Set up wallpaper picker
2. Some way to change between themes
3. Add some candy to terminal launches. Maybe pacman chasing ghosts and a print of the color palette.
4. Espanso
5. Figure out how to use disko
   1. Set up impermanence (after all config files have been nixified)
   2. Set up LUKS

* TODO Structural Changes for Configuration
1. Use ~lib.mkOption~ and ~lib.mkDefault~
2. Use a ~default.nix~ file for all of the defaults so there can be fewer import statements in the ~home.nix~.
* Home Manager
** Main File: home.nix
:PROPERTIES:
:header-args: :comments link :tangle ~/nixfiles/hosts/default/home.nix
:END:
#+BEGIN_SRC nix
{ config, pkgs, lib, inputs, username, defaultEditor, ... }:
{
#+END_SRC
You can also create simple shell scripts directly inside your configuration. For example, this adds a command 'my-hello' to your environment:

*** Imports
#+BEGIN_SRC nix
  imports = [
#+END_SRC
**** Scripts
#+BEGIN_SRC nix
../../modules/home-manager/scripts.nix
#+END_SRC
**** TODO Neomutt :issue:
Need to set this up with secrets
#+BEGIN_SRC nix
#../../modules/home-manager/neomutt.nix
#+END_SRC

**** Shell
#+BEGIN_SRC nix
../../modules/home-manager/nushell.nix
#+END_SRC
**** Editors
#+BEGIN_SRC nix
../../modules/home-manager/nixvim.nix
../../modules/home-manager/emacs.nix
#+END_SRC
***** TODO Editor Changes
- Set them to persist cursor location on close
- Set them to persist undo on close

**** CLI Utilities
#+BEGIN_SRC nix
../../modules/home-manager/bottom.nix
../../modules/home-manager/git.nix
#+END_SRC
**** Desktop
#+BEGIN_SRC nix
../../modules/home-manager/hyprland.nix
../../modules/home-manager/mako.nix
../../modules/home-manager/waybar.nix
../../modules/home-manager/wlogout.nix
#+END_SRC
***** Browsers :issue:
Separate the browsers into individual modules instead of having one module of all browsers.
#+BEGIN_SRC nix
../../modules/home-manager/browsers.nix
#+END_SRC
***** Terminal
#+BEGIN_SRC nix
../../modules/home-manager/kitty.nix
../../modules/home-manager/lf.nix
#+END_SRC
***** Nix Colors
#+BEGIN_SRC nix
inputs.nix-colors.homeManagerModules.default
../../modules/home-manager/colors.nix
#+END_SRC
***** Fonts
#+BEGIN_SRC nix
../../modules/home-manager/fonts.nix
#+END_SRC
**** Closing Bracket
#+BEGIN_SRC nix
];
#+END_SRC
*** Home Manager Variables
The ~username~ variable is declared in ~~/nixfiles/hosts/default/configuration.nix~
#+BEGIN_SRC nix
  home.username = "${username}";
  home.homeDirectory = "/home/${username}";
#+END_SRC

*** To Modularize :issue:
These need to be put in their own nix files to be imported, above in the import section.
**** fd
#+BEGIN_SRC nix
  programs.fd = {
    enable = true;
    hidden = true; # Pass --hidden flag by default
    ignores = [ # globally ignore given paths
      ".git/"
      "*.bak"
    ];
  };
#+END_SRC
**** thefuck
Type ~fuck~ after typing a command wrong to get suggestions for how to fix it.
#+BEGIN_SRC nix
  programs.thefuck = {
    enable = true;
    enableNushellIntegration = true;
  };
#+END_SRC
**** pandoc :issue:
Add ~.csl~ files for citation.
#+BEGIN_SRC nix
  programs.pandoc = {
    enable = true;
    citationStyles = [ # list of paths to .csl files
    ];
    defaults = {
      metadata = {
        revealjs-url = "..";
      };
      pdf-engine = "xelatex";
      citeproc = true; # Generates citations and bibliography from CSL
    };
  };
#+END_SRC

**** ripgrep
#+BEGIN_SRC nix
  programs.ripgrep = {
    enable = true;
    arguments = [
      "--max-columns-preview"
      "--colors=line:style:bold"
    ];
  };
#+END_SRC

*** Packages
lxqt-policykit-agent may be needed
#+BEGIN_SRC nix
  home.packages = with pkgs; [
#+END_SRC
**** Still to Sort
lxqt-policykit-agent may be necessary for virtio, etc.

#+BEGIN_SRC nix
  libreoffice
  bat
  bc
  brightnessctl
  brightnessctl
  bun
  dart-sass
  dbus
  exfat
  eww
  glib
  gnucash
  hugo
  jmtpfs
  jq
  keepassxc
  kitty
  kiwix
  libnotify
  ncdu
  rofi-wayland
  rofimoji
  slurp
  swappy
  swaylock
  swww
  taskwarrior3
  wayshot
  wf-recorder
  wl-clipboard
  wl-gammactl
  wofi
  wttrbar
  xdotool
  yad
#+END_SRC

**** Candy
Packages that are just for funsies
#+BEGIN_SRC nix
  pokeget-rs
  macchina
#+END_SRC
**** Document Management
#+BEGIN_SRC nix
  texliveFull
  zathura
#+END_SRC
**** CLI Utilities
#+BEGIN_SRC nix
  gh
  fdupes
  fzf
  killall
  mpv
  rsync
  tldr
  pamixer
  pciutils
#+END_SRC
**** Media :issue:
~mpc-cli~ and ~ncmpcpp~ are both music players. Probably don't need both. Music system not set up yet.

~playerctl~ controls MPRIS (D-Bus interface standard for controlling media players) media players. It should work for mpc-cli. Not sure if it will work for ncmpcpp.
#+BEGIN_SRC nix
  grimblast
  mpc-cli
  ncmpcpp
  nsxiv
  playerctl
#+END_SRC

**** Overrides
It is sometimes useful to fine-tune packages, for example, by applying overrides.

For example, this would install the Nerd Fonts package but with only the FantasqueSansMono font.
#+BEGIN_SRC nix
  # (pkgs.nerdfonts.override { fonts = [ "FantasqueSansMono" ]; })
#+END_SRC

**** Closing bracket
#+BEGIN_SRC nix
    ];
#+END_SRC

*** State Version
This value determines the Home Manager release that your configuration is compatible with.

This helps avoid breakage when a new Home Manager release introduces backwards incompatible changes.

You should not change this value, even if you update Home Manager.

If you do want to update the value, then make sure to first check the Home Manager release notes.
#+BEGIN_SRC nix
  home.stateVersion = "23.11";
#+END_SRC
*** Config Files Created by home.nix
Leave the comments until you need to use it.
#+BEGIN_SRC nix
  home.file = {
    # Building this configuration will create a copy of 'dotfiles/screenrc' in
    # the Nix store. Activating the configuration will then make '~/.screenrc' a
    # symlink to the Nix store copy.
    # ".screenrc".source = dotfiles/screenrc;

    # You can also set the file content immediately.
    # ".gradle/gradle.properties".text = ''
    #   org.gradle.console=verbose
    #   org.gradle.daemon.idletimeout=3600000
    # '';
  };
#+END_SRC

*** Session Variables :issue:
This does not seem to work for some reason.
It does work from within nushell.nix and see.
#+BEGIN_SRC nix
  home.sessionVariables = {
    EDITOR = "${defaultEditor}";
  };
#+END_SRC

*** Let Home Manager install and manage itself
#+BEGIN_SRC nix
  programs.home-manager.enable = true;
#+END_SRC

*** Closing
#+BEGIN_SRC nix
  }
#+END_SRC
** Services
:PROPERTIES:
:header-args: :comments link :tangle ~/nixfiles/modules/home-manager/services.nix
:END:
#+BEGIN_SRC nix
  { ... }:
  {
#+END_SRC

**** Emacs
#+BEGIN_SRC nix
      services.emacs.client.enable = true;
#+END_SRC
**** Closing
#+BEGIN_SRC nix
    }
#+END_SRC
** Shell Scripts
:PROPERTIES:
:header-args: :comments link :tangle ~/nixfiles/modules/home-manager/scripts.nix
:END:
#+BEGIN_SRC nix
  { pkgs, ... }:
  {
    home.packages = with pkgs; [
#+END_SRC
