hosts/default/home.nix
# [[file:../../README.org::*Main File: home.nix][Main File: home.nix:1]]
{ config, pkgs, lib, inputs, username, defaultEditor, ... }:
{
# Main File: home.nix:1 ends here

# [[file:../../README.org::*Imports][Imports:1]]
imports = [
# Imports:1 ends here

# [[file:../../README.org::*Scripts][Scripts:1]]
../../modules/home-manager/scripts.nix
# Scripts:1 ends here

# [[file:../../README.org::*Neomutt][Neomutt:1]]
#../../modules/home-manager/neomutt.nix
# Neomutt:1 ends here

# [[file:../../README.org::*Shell][Shell:1]]
../../modules/home-manager/nushell.nix
# Shell:1 ends here

# [[file:../../README.org::*Editors][Editors:1]]
../../modules/home-manager/nixvim.nix
../../modules/home-manager/emacs.nix
# Editors:1 ends here

# [[file:../../README.org::*CLI Utilities][CLI Utilities:1]]
../../modules/home-manager/bottom.nix
../../modules/home-manager/git.nix
# CLI Utilities:1 ends here

# [[file:../../README.org::*Desktop][Desktop:1]]
../../modules/home-manager/hyprland.nix
../../modules/home-manager/mako.nix
../../modules/home-manager/waybar.nix
../../modules/home-manager/wlogout.nix
# Desktop:1 ends here

# [[file:../../README.org::*Browsers][Browsers:1]]
../../modules/home-manager/browsers.nix
# Browsers:1 ends here

# [[file:../../README.org::*Terminal][Terminal:1]]
../../modules/home-manager/kitty.nix
../../modules/home-manager/lf.nix
# Terminal:1 ends here

# [[file:../../README.org::*Nix Colors][Nix Colors:1]]
inputs.nix-colors.homeManagerModules.default
../../modules/home-manager/colors.nix
# Nix Colors:1 ends here

# [[file:../../README.org::*Fonts][Fonts:1]]
../../modules/home-manager/fonts.nix
# Fonts:1 ends here

# [[file:../../README.org::*Closing Bracket][Closing Bracket:1]]
];
# Closing Bracket:1 ends here

# [[file:../../README.org::*Services][Services:1]]
{ ... }:
{
# Services:1 ends here

# [[file:../../README.org::*Emacs][Emacs:1]]
services.emacs.client.enable = true;
# Emacs:1 ends here

# [[file:../../README.org::*Closing][Closing:1]]
}
# Closing:1 ends here

# [[file:../../README.org::*Home Manager Variables][Home Manager Variables:1]]
home.username = "${username}";
home.homeDirectory = "/home/${username}";
# Home Manager Variables:1 ends here

# [[file:../../README.org::*fd][fd:1]]
programs.fd = {
  enable = true;
  hidden = true; # Pass --hidden flag by default
  ignores = [ # globally ignore given paths
    ".git/"
    "*.bak"
  ];
};
# fd:1 ends here

# [[file:../../README.org::*thefuck][thefuck:1]]
programs.thefuck = {
  enable = true;
  enableNushellIntegration = true;
};
# thefuck:1 ends here

# [[file:../../README.org::*pandoc][pandoc:1]]
programs.pandoc = {
  enable = true;
  citationStyles = [ # list of paths to .csl files
  ];
  defaults = {
    metadata = {
      revealjs-url = "..";
    };
    pdf-engine = "xelatex";
    citeproc = true; # Generates citations and bibliography from CSL
  };
};
# pandoc:1 ends here

# [[file:../../README.org::*ripgrep][ripgrep:1]]
programs.ripgrep = {
  enable = true;
  arguments = [
    "--max-columns-preview"
    "--colors=line:style:bold"
  ];
};
# ripgrep:1 ends here

# [[file:../../README.org::*Packages][Packages:1]]
home.packages = with pkgs; [
# Packages:1 ends here

# [[file:../../README.org::*Still to Sort][Still to Sort:1]]
bat
bc
brightnessctl
brightnessctl
bun
dart-sass
dbus
exfat
eww
glib
gnucash
hugo
jmtpfs
jq
keepassxc
kitty
kiwix
libnotify
ncdu
rofi-wayland
rofimoji
slurp
swappy
swaylock
swww
taskwarrior3
wayshot
wf-recorder
wl-clipboard
wl-gammactl
wofi
wttrbar
xdotool
yad
# Still to Sort:1 ends here

# [[file:../../README.org::*Candy][Candy:1]]
pokeget-rs
macchina
# Candy:1 ends here

# [[file:../../README.org::*Document Management][Document Management:1]]
texliveFull
zathura
# Document Management:1 ends here

# [[file:../../README.org::*CLI Utilities][CLI Utilities:1]]
gh
fdupes
fzf
killall
mpv
rsync
tldr
pamixer
pciutils
# CLI Utilities:1 ends here

# [[file:../../README.org::*Media][Media:1]]
grimblast
mpc-cli
ncmpcpp
nsxiv
playerctl
# Media:1 ends here

# [[file:../../README.org::*Overrides][Overrides:1]]
# (pkgs.nerdfonts.override { fonts = [ "FantasqueSansMono" ]; })
